[
  {"id": 1, "title": "Python Basics", "content": "Python is an interpreted, high-level programming language."},
  {"id": 2, "title": "Machine Learning", "content": "Machine learning allows systems to learn from data without being explicitly programmed."},
  {"id": 3, "title": "Data Science", "content": "Data science combines domain expertise, programming skills, and knowledge of mathematics and statistics."},
  {"id": 4, "title": "Neural Networks", "content": "Neural networks are a subset of machine learning, inspired by the structure of the human brain."},
  {"id": 5, "title": "Deep Learning", "content": "Deep learning uses neural networks with many layers."},
  {"id": 6, "title": "Natural Language Processing", "content": "NLP enables computers to understand human language."},
  {"id": 7, "title": "Computer Vision", "content": "Computer vision involves teaching machines to interpret and understand visual information."},
  {"id": 8, "title": "Big Data", "content": "Big data refers to extremely large data sets that may be analyzed computationally."},
  {"id": 9, "title": "Reinforcement Learning", "content": "Reinforcement learning is a feedback-based machine learning method."},
  {"id": 10, "title": "Support Vector Machines", "content": "SVMs are supervised learning models for classification and regression."},
  {"id": 11, "title": "Decision Trees", "content": "Decision trees are used for classification and regression tasks."},
  {"id": 12, "title": "Random Forest", "content": "Random forests are ensembles of decision trees."},
  {"id": 13, "title": "K-Means Clustering", "content": "K-Means is an unsupervised algorithm used for clustering."},
  {"id": 14, "title": "Pandas Library", "content": "Pandas is a Python library used for data manipulation and analysis."},
  {"id": 15, "title": "NumPy Library", "content": "NumPy is used for working with arrays and numerical data."},
  {"id": 16, "title": "Matplotlib", "content": "Matplotlib is a plotting library for Python."},
  {"id": 17, "title": "Scikit-Learn", "content": "Scikit-learn is a machine learning library in Python."},
  {"id": 18, "title": "TensorFlow", "content": "TensorFlow is an open-source library for machine learning and deep learning."},
  {"id": 19, "title": "PyTorch", "content": "PyTorch is a popular open-source machine learning library."},
  {"id": 20, "title": "Transfer Learning", "content": "Transfer learning is a technique where a model trained on one task is used for another."},
  {"id": 21, "title": "Dimensionality Reduction", "content": "Techniques like PCA help reduce the number of input variables."},
  {"id": 22, "title": "Principal Component Analysis", "content": "PCA is used to reduce dimensionality of datasets."},
  {"id": 23, "title": "Gradient Descent", "content": "Gradient descent is an optimization algorithm used to minimize loss."},
  {"id": 24, "title": "Overfitting and Underfitting", "content": "These are key challenges in machine learning model training."},
  {"id": 25, "title": "Cross Validation", "content": "Cross-validation is a technique for assessing model performance."},
  {"id": 26, "title": "Hyperparameter Tuning", "content": "Tuning hyperparameters is essential for model optimization."},
  {"id": 27, "title": "Feature Engineering", "content": "Feature engineering involves creating new input features."},
  {"id": 28, "title": "Feature Selection", "content": "Feature selection reduces the number of input variables to those that are most useful."},
  {"id": 29, "title": "Model Evaluation Metrics", "content": "Metrics like accuracy, precision, recall are used to evaluate models."},
  {"id": 30, "title": "Logistic Regression", "content": "Logistic regression is used for binary classification tasks."},
  {"id": 31, "title": "Linear Regression", "content": "Linear regression is used for predicting a continuous value."},
  {"id": 32, "title": "Bayesian Networks", "content": "Bayesian networks are graphical models that represent probabilistic relationships."},
  {"id": 33, "title": "Markov Chains", "content": "Markov chains model stochastic processes with memoryless transitions."},
  {"id": 34, "title": "Information Retrieval", "content": "IR deals with obtaining relevant information from large collections."},
  {"id": 35, "title": "Vector Space Model", "content": "In VSM, documents and queries are represented as vectors."},
  {"id": 36, "title": "TF-IDF", "content": "TF-IDF is used to evaluate the importance of a word in a document."},
  {"id": 37, "title": "Cosine Similarity", "content": "Cosine similarity measures similarity between two vectors."},
  {"id": 38, "title": "Jaccard Similarity", "content": "Jaccard index measures similarity between finite sets."},
  {"id": 39, "title": "Lucene Search", "content": "Lucene is a text search engine library."},
  {"id": 40, "title": "Elasticsearch", "content": "Elasticsearch is a distributed search and analytics engine."},
  {"id": 41, "title": "BM25 Ranking", "content": "BM25 is a ranking function for IR based on probabilistic retrieval."},
  {"id": 42, "title": "Question Answering", "content": "QA systems return answers to questions posed in natural language."},
  {"id": 43, "title": "Conversational AI", "content": "Conversational AI simulates human-like dialogue."},
  {"id": 44, "title": "Chatbots", "content": "Chatbots are AI agents designed for interaction with users."},
  {"id": 45, "title": "Search Engine Indexing", "content": "Indexing improves speed and efficiency of search queries."},
  {"id": 46, "title": "Web Crawling", "content": "Web crawlers automatically browse and download web content."},
  {"id": 47, "title": "Knowledge Graphs", "content": "Knowledge graphs store relationships between entities."},
  {"id": 48, "title": "Named Entity Recognition", "content": "NER identifies proper names in text such as people, places, and organizations."},
  {"id": 49, "title": "Relation Extraction", "content": "Relation extraction finds relationships between entities in text."},
  {"id": 50, "title": "Text Summarization", "content": "Summarization condenses text into a shorter version retaining key information."}
]
